<a href="https://colab.research.google.com/github/csrajath/AlumniWebApp/blob/master/pandasing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [69]:
import pandas as pd
import numpy as np

In [75]:
df = pd.DataFrame({'name':['raj','ram','rak','rav','manu','sush','aish','rkk','nik'], 'age':[23,34,56,23,12,24,56,78,54], 'score':np.random.random(9).round(3)})

## Filtering Techniques

In [78]:
print(df[df.name<'ram'])

   name  age  score
0   raj   23  0.067
2   rak   56  0.579
4  manu   12  0.229
6  aish   56  0.821
8   nik   54  0.264

In [82]:
print(df[(df.age>25)& (df.score<0.5)])

  name  age  score
1  ram   34  0.277
7  rkk   78  0.060
8  nik   54  0.264

In [84]:
print(df[df.name.str.startswith('a')])

   name  age  score
6  aish   56  0.821

In [87]:
print(df[~df.name.str.startswith('r')])

   name  age  score
4  manu   12  0.229
5  sush   24  0.255
6  aish   56  0.821
8   nik   54  0.264

In [89]:
print(df.iloc[3:9,:])

   name  age  score
3   rav   23  0.595
4  manu   12  0.229
5  sush   24  0.255
6  aish   56  0.821
7   rkk   78  0.060
8   nik   54  0.264

In [91]:
print(df.loc[4:7,:])

   name  age  score
4  manu   12  0.229
5  sush   24  0.255
6  aish   56  0.821
7   rkk   78  0.060

In [93]:
df.index=['a','b','c','d','e','f','g','h','i']

In [95]:
df.loc['a':'e',:]

   name  age  score
a   raj   23  0.067
b   ram   34  0.277
c   rak   56  0.579
d   rav   23  0.595
e  manu   12  0.229

In [98]:
print(df.query('age==56 & score<0.6'))

  name  age  score
c  rak   56  0.579